| scene_type  | class             |  TP |  FN | TP_rate |  FP |  TN | FP_rate |  dist |
|-------------+-------------------+-----+-----+---------+-----+-----+---------+-------|
| kitchen     | Spoon             |   3 |  58 |   0.049 |   3 | 351 |   0.008 | 1.737 |
| kitchen     | Egg               |   9 |  11 |   0.450 |   4 | 391 |   0.010 | 1.338 |
| kitchen     | Fork              |   3 |  61 |   0.047 |   7 | 345 |   0.020 | 1.294 |
| kitchen     | Lettuce           |  69 |   1 |   0.986 |  12 | 344 |   0.034 | 1.983 |
| kitchen     | Plate             |  60 |  39 |   0.606 |  11 | 306 |   0.035 | 1.901 |
| kitchen     | DishSponge        |  40 |  24 |   0.625 |  13 | 341 |   0.037 | 1.624 |
| kitchen     | LightSwitch       |  72 |   8 |   0.900 |  15 | 322 |   0.045 | 2.565 |
| kitchen     | Mug               |  37 |  39 |   0.487 |  18 | 325 |   0.052 | 1.691 |
| kitchen     | Microwave         |  70 |  23 |   0.753 |  18 | 304 |   0.056 | 2.309 |
| kitchen     | GarbageCan        |  81 |  28 |   0.743 |  23 | 288 |   0.074 | 2.132 |
| kitchen     | Bread             |  73 |  28 |   0.723 |  28 | 297 |   0.086 | 1.989 |
| kitchen     | Pan               |  42 |  29 |   0.592 |  33 | 318 |   0.094 | 2.316 |
| kitchen     | Tomato            |  45 |  16 |   0.738 |  38 | 328 |   0.104 | 1.658 |
| kitchen     | Fridge            | 133 |  56 |   0.704 |  25 | 208 |   0.107 | 2.181 |
| kitchen     | Spatula           |  16 |  66 |   0.195 |  38 | 306 |   0.110 | 1.179 |
| kitchen     | Potato            |  62 |   8 |   0.886 |  43 | 323 |   0.117 | 1.715 |
| kitchen     | SaltShaker        |  45 |  41 |   0.523 |  43 | 317 |   0.119 | 2.124 |
| kitchen     | Cup               |  22 |  58 |   0.275 |  43 | 303 |   0.124 | 1.760 |
| kitchen     | SoapBottle        |  56 |  24 |   0.700 |  45 | 314 |   0.125 | 2.305 |
| kitchen     | PepperShaker      |  38 |  43 |   0.469 |  47 | 316 |   0.129 | 1.676 |
| kitchen     | Faucet            |  49 |  29 |   0.628 |  49 | 321 |   0.132 | 2.161 |
| kitchen     | Apple             |  34 |  20 |   0.630 |  51 | 326 |   0.135 | 1.783 |
| kitchen     | CoffeeMachine     |  93 |  15 |   0.861 |  47 | 278 |   0.145 | 2.236 |
| kitchen     | Knife             |  24 |  39 |   0.381 |  55 | 319 |   0.147 | 1.427 |
| kitchen     | Toaster           |  94 |  13 |   0.879 |  48 | 273 |   0.150 | 2.263 |
| kitchen     | StoveKnob         | 247 |  16 |   0.939 |  55 | 304 |   0.153 | 1.999 |
| kitchen     | Bowl              |  44 |  26 |   0.629 |  62 | 309 |   0.167 | 1.750 |
| kitchen     | Pot               |  58 |  30 |   0.659 |  70 | 278 |   0.201 | 1.671 |
| kitchen     | Sink              |  72 |  28 |   0.720 |  77 | 293 |   0.208 | 1.697 |
| kitchen     | StoveBurner       | 283 |  14 |   0.953 |  97 | 278 |   0.259 | 1.897 |
| kitchen     | Floor             | 248 |  36 |   0.873 |  40 | 112 |   0.263 | 2.891 |
| kitchen     | CounterTop        | 184 |  47 |   0.797 | 132 | 150 |   0.468 | 1.901 |
| kitchen     | Cabinet           | 679 |  40 |   0.944 | 203 | 139 |   0.594 | 2.215 |
|-------------+-------------------+-----+-----+---------+-----+-----+---------+-------|
| living_room | KeyChain          |  20 |  49 |   0.290 |   7 | 340 |   0.020 | 1.871 |
| living_room | CreditCard        |  27 |  36 |   0.429 |  18 | 337 |   0.051 | 1.625 |
| living_room | GarbageCan        |  75 |  47 |   0.615 |  20 | 278 |   0.067 | 2.991 |
| living_room | Box               |  65 |  36 |   0.644 |  28 | 299 |   0.086 | 2.467 |
| living_room | Laptop            |  69 |  35 |   0.663 |   9 | 303 |   0.029 | 2.568 |
| living_room | Pillow            |  64 |  31 |   0.674 |  12 | 311 |   0.037 | 2.440 |
| living_room | RemoteControl     |  59 |  24 |   0.711 |  40 | 321 |   0.111 | 2.038 |
| living_room | Sofa              | 128 |  52 |   0.711 |  46 | 219 |   0.174 | 2.788 |
| living_room | FloorLamp         |  86 |  34 |   0.717 |  16 | 280 |   0.054 | 3.176 |
| living_room | LightSwitch       |  58 |  14 |   0.806 |   8 | 338 |   0.023 | 3.162 |
| living_room | HousePlant        |  98 |  19 |   0.838 |  16 | 292 |   0.052 | 2.781 |
| living_room | Television        |  94 |  16 |   0.855 |  27 | 290 |   0.085 | 2.672 |
| living_room | Painting          | 142 |  21 |   0.871 |  15 | 262 |   0.054 | 3.174 |
| living_room | Floor             | 269 |  34 |   0.888 |  35 |  96 |   0.267 | 2.884 |
|-------------+-------------------+-----+-----+---------+-----+-----+---------+-------|
| bedroom     | AlarmClock        |  75 |  19 |   0.798 |  38 | 327 |   0.104 | 2.842 |
| bedroom     | Bed               | 150 |  84 |   0.641 |  21 | 203 |   0.094 | 2.393 |
| bedroom     | Book              |  66 |  37 |   0.641 |  22 | 330 |   0.062 | 2.219 |
| bedroom     | CD                |  36 |  36 |   0.500 |  19 | 359 |   0.050 | 1.900 |
| bedroom     | CellPhone         |  43 |  43 |   0.500 |  20 | 346 |   0.055 | 1.623 |
| bedroom     | CreditCard        |  38 |  47 |   0.447 |   9 | 353 |   0.025 | 1.738 |
| bedroom     | DeskLamp          | 121 |  14 |   0.896 |  10 | 305 |   0.032 | 2.849 |
| bedroom     | Floor             | 279 |  33 |   0.894 |  52 | 107 |   0.327 | 2.019 |
| bedroom     | GarbageCan        |  75 |  17 |   0.815 |  11 | 344 |   0.031 | 2.597 |
| bedroom     | KeyChain          |  19 |  63 |   0.232 |  16 | 350 |   0.044 | 1.834 |
| bedroom     | Laptop            |  88 |  28 |   0.759 |   7 | 326 |   0.021 | 2.093 |
| bedroom     | LightSwitch       |  71 |  22 |   0.763 |  15 | 343 |   0.042 | 2.175 |
| bedroom     | Mirror            | 104 |  17 |   0.860 |   4 | 323 |   0.012 | 2.188 |
| bedroom     | Pen               |  15 |  63 |   0.192 |  24 | 350 |   0.064 | 1.500 |
| bedroom     | Pencil            |  12 |  69 |   0.148 |  17 | 356 |   0.046 | 1.754 |
| bedroom     | Pillow            | 136 |  12 |   0.919 |  31 | 325 |   0.087 | 2.808 |
| bedroom     | Window            | 179 |  21 |   0.895 |  38 | 253 |   0.131 | 2.829 |
|-------------+-------------------+-----+-----+---------+-----+-----+---------+-------|
| bathroom    | ScrubBrush        |  25 |  60 |   0.294 |  11 | 326 |   0.033 | 1.906 |
| bathroom    | Plunger           |  34 |  33 |   0.507 |  15 | 343 |   0.042 | 1.921 |
| bathroom    | Floor             | 174 | 104 |   0.626 |  15 | 126 |   0.106 | 2.607 |
| bathroom    | Candle            |  56 |  30 |   0.651 |  60 | 302 |   0.166 | 1.653 |
| bathroom    | SoapBar           |  60 |  22 |   0.732 |  16 | 331 |   0.046 | 1.463 |
| bathroom    | SprayBottle       |  51 |  18 |   0.739 |  32 | 326 |   0.089 | 1.680 |
| bathroom    | GarbageCan        | 105 |  33 |   0.761 |  24 | 266 |   0.083 | 1.948 |
| bathroom    | TowelHolder       |  69 |  18 |   0.793 |  62 | 298 |   0.172 | 1.809 |
| bathroom    | Mirror            | 131 |  34 |   0.794 |  15 | 262 |   0.054 | 1.920 |
| bathroom    | Towel             | 101 |  26 |   0.795 |  14 | 285 |   0.047 | 1.761 |
| bathroom    | ToiletPaperHanger |  77 |  14 |   0.846 |   6 | 324 |   0.018 | 1.818 |
| bathroom    | Toilet            | 138 |  22 |   0.863 |  17 | 250 |   0.064 | 1.716 |
| bathroom    | HandTowel         |  83 |  12 |   0.874 |  23 | 309 |   0.069 | 2.026 |
| bathroom    | Sink              | 255 |  25 |   0.911 |  32 | 249 |   0.114 | 1.429 |
| bathroom    | SoapBottle        |  88 |   8 |   0.917 |  40 | 305 |   0.116 | 1.580 |
| bathroom    | LightSwitch       |  79 |   7 |   0.919 |  16 | 319 |   0.048 | 1.858 |
| bathroom    | Faucet            | 157 |  13 |   0.924 |  91 | 245 |   0.271 | 1.828 |
| bathroom    | ToiletPaper       |  97 |   7 |   0.933 |  22 | 325 |   0.063 | 1.692 |
| bathroom    | Cloth             |  69 |   3 |   0.958 |  50 | 329 |   0.132 | 1.533 |






























| scene       | class             |  TP |  FN | TP_rate | FP | FP_off |  TN | FP_rate |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------|
| kitchen     | Apple             |  29 |  20 |   0.592 | 40 |     40 | 326 |   0.109 |
| kitchen     | Bowl              |  40 |  26 |   0.606 | 40 |     40 | 309 |   0.115 |
| kitchen     | Bread             |  72 |  28 |   0.720 | 18 |     17 | 297 |   0.057 |
| kitchen     | Cabinet           | 171 |  40 |   0.810 | 65 |     52 | 139 |   0.319 |
| kitchen     | CoffeeMachine     |  91 |  15 |   0.858 | 31 |     30 | 278 |   0.100 |
| kitchen     | CounterTop        | 141 |  47 |   0.750 | 77 |     57 | 150 |   0.339 |
| kitchen     | Cup               |  19 |  58 |   0.247 | 35 |     35 | 303 |   0.104 |
| kitchen     | DishSponge        |  39 |  24 |   0.619 | 11 |      8 | 341 |   0.031 |
| kitchen     | Egg               |   9 |  11 |   0.450 |  4 |      4 | 391 |   0.010 |
| kitchen     | Faucet            |  37 |  29 |   0.561 | 28 |      4 | 321 |   0.080 |
| kitchen     | Floor             | 241 |  36 |   0.870 | 26 |     10 | 112 |   0.188 |
| kitchen     | Fork              |   3 |  61 |   0.047 |  6 |      6 | 345 |   0.017 |
| kitchen     | Fridge            | 133 |  56 |   0.704 | 18 |     17 | 208 |   0.080 |
| kitchen     | GarbageCan        |  81 |  28 |   0.743 | 18 |     18 | 288 |   0.059 |
| kitchen     | Knife             |  24 |  39 |   0.381 | 33 |     31 | 319 |   0.094 |
| kitchen     | Lettuce           |  69 |   1 |   0.986 |  1 |      1 | 344 |   0.003 |
| kitchen     | LightSwitch       |  72 |   8 |   0.900 | 13 |     11 | 322 |   0.039 |
| kitchen     | Microwave         |  70 |  23 |   0.753 | 18 |     16 | 304 |   0.056 |
| kitchen     | Mug               |  34 |  39 |   0.466 | 17 |     17 | 325 |   0.050 |
| kitchen     | Pan               |  39 |  29 |   0.574 | 29 |     26 | 318 |   0.084 |
| kitchen     | PepperShaker      |  26 |  43 |   0.377 | 30 |     30 | 316 |   0.087 |
| kitchen     | Plate             |  60 |  39 |   0.606 | 10 |     10 | 306 |   0.032 |
| kitchen     | Pot               |  56 |  30 |   0.651 | 51 |     51 | 278 |   0.155 |
| kitchen     | Potato            |  56 |   8 |   0.875 | 28 |     28 | 323 |   0.080 |
| kitchen     | SaltShaker        |  33 |  41 |   0.446 | 24 |     19 | 317 |   0.070 |
| kitchen     | Sink              |  61 |  28 |   0.685 | 33 |      8 | 293 |   0.101 |
| kitchen     | SoapBottle        |  54 |  24 |   0.692 | 23 |     21 | 314 |   0.068 |
| kitchen     | Spatula           |  15 |  66 |   0.185 | 28 |     25 | 306 |   0.084 |
| kitchen     | Spoon             |   3 |  58 |   0.049 |  3 |      3 | 351 |   0.008 |
| kitchen     | StoveBurner       | 103 |  14 |   0.880 | 20 |     13 | 278 |   0.067 |
| kitchen     | StoveKnob         |  77 |  16 |   0.828 | 18 |     12 | 304 |   0.056 |
| kitchen     | Toaster           |  94 |  13 |   0.879 | 35 |     35 | 273 |   0.114 |
| kitchen     | Tomato            |  45 |  16 |   0.738 | 26 |     26 | 328 |   0.073 |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------|
| living_room | Box               |  64 |  36 |   0.640 | 16 |     12 | 299 |   0.051 |
| living_room | CreditCard        |  27 |  36 |   0.429 | 15 |     15 | 337 |   0.043 |
| living_room | Floor             | 266 |  34 |   0.887 | 19 |      1 |  96 |   0.165 |
| living_room | FloorLamp         |  86 |  34 |   0.717 | 15 |      9 | 280 |   0.051 |
| living_room | GarbageCan        |  74 |  47 |   0.612 | 16 |     13 | 278 |   0.054 |
| living_room | HousePlant        |  92 |  19 |   0.829 | 12 |      6 | 292 |   0.039 |
| living_room | KeyChain          |  20 |  49 |   0.290 |  6 |      4 | 340 |   0.017 |
| living_room | Laptop            |  69 |  35 |   0.663 |  8 |      5 | 303 |   0.026 |
| living_room | LightSwitch       |  58 |  14 |   0.806 |  5 |      2 | 338 |   0.015 |
| living_room | Painting          | 121 |  21 |   0.852 | 11 |      9 | 262 |   0.040 |
| living_room | Pillow            |  64 |  31 |   0.674 |  9 |      9 | 311 |   0.028 |
| living_room | RemoteControl     |  55 |  24 |   0.696 | 15 |     14 | 321 |   0.045 |
| living_room | Sofa              | 119 |  52 |   0.696 | 25 |     20 | 219 |   0.102 |
| living_room | Television        |  93 |  16 |   0.853 | 16 |     16 | 290 |   0.052 |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------|
| bedroom     | AlarmClock        |  74 |  19 |   0.796 | 26 |     24 | 327 |   0.074 |
| bedroom     | Bed               | 146 |  84 |   0.635 | 13 |      9 | 203 |   0.060 |
| bedroom     | Book              |  62 |  37 |   0.626 | 17 |     15 | 330 |   0.049 |
| bedroom     | CD                |  34 |  36 |   0.486 | 17 |     16 | 359 |   0.045 |
| bedroom     | CellPhone         |  43 |  43 |   0.500 | 14 |     12 | 346 |   0.039 |
| bedroom     | CreditCard        |  38 |  47 |   0.447 |  8 |      6 | 353 |   0.022 |
| bedroom     | DeskLamp          | 119 |  14 |   0.895 |  8 |      7 | 305 |   0.026 |
| bedroom     | Floor             | 272 |  33 |   0.892 | 34 |     12 | 107 |   0.241 |
| bedroom     | GarbageCan        |  75 |  17 |   0.815 | 10 |     10 | 344 |   0.028 |
| bedroom     | KeyChain          |  18 |  63 |   0.222 | 15 |     11 | 350 |   0.041 |
| bedroom     | Laptop            |  88 |  28 |   0.759 |  4 |      4 | 326 |   0.012 |
| bedroom     | LightSwitch       |  71 |  22 |   0.763 | 10 |     10 | 343 |   0.028 |
| bedroom     | Mirror            | 104 |  17 |   0.860 |  2 |      2 | 323 |   0.006 |
| bedroom     | Pen               |  13 |  63 |   0.171 | 20 |      8 | 350 |   0.054 |
| bedroom     | Pencil            |  10 |  69 |   0.127 | 11 |     10 | 356 |   0.030 |
| bedroom     | Pillow            |  91 |  12 |   0.883 | 18 |     16 | 325 |   0.052 |
| bedroom     | Window            | 149 |  21 |   0.876 | 23 |      2 | 253 |   0.083 |
|-------------+-------------------+-----+-----+---------+----+--------+-----+---------|
| bathroom    | Candle            |  54 |  30 |   0.643 | 33 |     31 | 302 |   0.099 |
| bathroom    | Cloth             |  66 |   3 |   0.957 | 21 |     19 | 329 |   0.060 |
| bathroom    | Faucet            | 122 |  13 |   0.904 | 39 |     22 | 245 |   0.137 |
| bathroom    | Floor             | 174 | 104 |   0.626 | 15 |      5 | 126 |   0.106 |
| bathroom    | GarbageCan        | 104 |  33 |   0.759 | 16 |     15 | 266 |   0.057 |
| bathroom    | HandTowel         |  83 |  12 |   0.874 | 15 |     13 | 309 |   0.046 |
| bathroom    | LightSwitch       |  79 |   7 |   0.919 | 14 |     12 | 319 |   0.042 |
| bathroom    | Mirror            | 113 |  34 |   0.769 | 10 |      7 | 262 |   0.037 |
| bathroom    | Plunger           |  34 |  33 |   0.507 |  9 |      1 | 343 |   0.026 |
| bathroom    | ScrubBrush        |  25 |  60 |   0.294 |  8 |      4 | 326 |   0.024 |
| bathroom    | Sink              | 133 |  25 |   0.842 | 12 |     10 | 249 |   0.046 |
| bathroom    | SoapBar           |  60 |  22 |   0.732 |  6 |      5 | 331 |   0.018 |
| bathroom    | SoapBottle        |  85 |   8 |   0.914 | 21 |     18 | 305 |   0.064 |
| bathroom    | SprayBottle       |  51 |  18 |   0.739 | 24 |     23 | 326 |   0.069 |
| bathroom    | Toilet            | 138 |  22 |   0.863 |  9 |      8 | 250 |   0.035 |
| bathroom    | ToiletPaper       |  73 |   7 |   0.912 | 14 |     13 | 325 |   0.041 |
| bathroom    | ToiletPaperHanger |  76 |  14 |   0.844 |  5 |      3 | 324 |   0.015 |
| bathroom    | Towel             | 100 |  26 |   0.794 |  8 |      7 | 285 |   0.027 |
| bathroom    | TowelHolder       |  61 |  18 |   0.772 | 42 |     15 | 298 |   0.124 |
#+TBLFM: $5=$5;%0.3f
#+TBLFM: $9=$9;%0.3f
